
export const ErrCodeMap: Record<number, string> = {
  // 系统错误 (10000-10099)
  10000: "系统错误",
  10001: "无效的参数",
  10002: "未授权访问",
  10003: "禁止访问",
  10004: "操作过于频繁",
  10005: "资源未找到",
  10006: "服务器内部错误",
  10007:  "无效的分页参数",
  10010: "LiveKit URL错误",
  10090: "API错误",
  10091: "请求超时",

  // 群组错误 (1200-1299)
  1207: "群组加入功能已被禁用",

  // 交易错误 (10100-10199)
  10100: "钱包余额不足",
  10101: "交易已过期",
  10102: "交易未找到",
  10103: "无效的金额",
  10104: "已经领取过",
  10107:  "钱包未开通",
  10108: "钱包已开通",
  10109: "没有剩余金额或数量",
  10110: "获取分布式锁失败",
  10112: "普通红包金额必须能被数量整除",
  10113: "钱包余额未开通",

  // ValidateReceiverInfo 相关错误码: 10114-10130
  10114: "接收者不属于该组织",
  10115: "接收者和发送者不在同一组织",
  10116: "转账类型不允许发送者接收",
  10117: "接收者不是交易的目标用户",
  10118: "组织转账的接收者必须是管理员",
  10119: "接收者不是专属红包的指定接收者",
  10120: "未知的交易类型",

  // 余额错误 (10200-10299)
  10200: "余额未找到",
  10201: "余额更新失败",

  // user errors: 10300-10399
  10300: "超过设备注册上限",

  // 账户错误 (11000-11500)
  11002: "用户账户错误",
  11003: "用户未找到",
  11004:  "密码错误",
  11006: "账户已存在",

  // 原有错误码
  20001:  "密码错误",
  20002:  "账号不存在",
  20003: "手机号已注册",
  20004:"账号已注册",
  20005: "操作过于频繁，请稍后再试",
  20006: "验证码错误",
  20007: "验证码已过期",
  20008: "验证码错误次数超限，请稍后再试",
  20009: "验证码已使用",
  20010:  "邀请码已使用",
  20011:"邀请码不存在",
  20012:"操作受限",
  20014:  "账号已注册",
}

export const getErrCodeMessage = (code: number): string => {
  console.log('code',code,ErrCodeMap[code]);

  return ErrCodeMap[code] || ''
}

export enum SendFailedErrCode {
  Blacked = 1302,
}
